<?php

namespace Database\Seeders;

use Illuminate\Database\Eloquent\Factories\Factory;
use Illuminate\Database\Seeder;
use App\Models\RealEstate;
use App\Models\Location;
use App\Models\RealEstateType;
use Illuminate\Support\Str;

class RealEstateTableSeeder extends Seeder
{
    public function run()
    {
        $locations = Location::all();
        $realEstateTypes = RealEstateType::all();

        $titles = [
            'Сучасна квартира в новобудові', //1
            'Чудовий будинок біля лісу', //2
            'Котедж з власним садом', //3
            'Таунхаус на березі річки', //4
            'Ексклюзивна садиба з виглядом на озеро', //5
            'Дача для відпочинку на природі', //6
            'Нова квартира з індивідуальним дизайном', //7
            'Затишний будинок у селі', //8
            'Елегантний котедж з басейном', //9
            'Панорамний таунхаус з видом на місто', //10
            'Старовинна садиба зі старовинними меблями', //11
            'Простора дача зі зручною локацією', //12
            'Квартира в історичній частині міста', //13
            'Просторий будинок для сім\'ї', //14
            'Котедж в стилі лофт', //15
            'Стильний таунхаус в центрі', //16
            'Сучасна садиба біля лісу', //17
            'Дача на околиці міста', //18
            'Затишна квартира у зеленому районі', //19
            'Елегантний особняк у центрі', //20
            'Модний котедж біля центру', //21
            'Таунхаус з виглядом на парк', //22
            'Сучасна та затишна садиба', //23
            'Еко-дача на березі озера', //24
            'Простора квартира в історичному центрі', //25
            'Будинок з розкішною терасою', //26
            'Котедж поряд з парком', //27
            'Новий таунхаус біля лісу', //28
            'Садиба у горах', //29
            'Елітна дача за містом' //30
        ];

        $streets = [
            'вул. Вишнева', //1
            'вул. Київська',
            'вул. Грушева',
            'вул. Першотравнева',
            'вул. Героїв Крут',
            'вул. Шевченка',//6
            'вул. Садова',
            'вул. Героїв України', //8
            'вул. Миру',
            'вул. Незалежності', //10
            'вул. Соборна',
            'вул. Івана Франка,с. Кам’янка', //12
            'вул. Хмельницького, с. Грушеве',
            'вул. Чорновола, смт. Світло', //14
            'вул. Грушевського, смт. Щастя',
            'вул. Сумська, с. Жито', //16
            'вул. Коцюбинського, с. Гута',
            'вул. Гоголя', //18
            'вул. Молодіжна',
            'вул. Весняна', //20
            'вул. Героїв Дніпра',
            'вул. Петра Дорошенка', //22
            'вул. Володимира Великого',
            'вул. Степана Бандери', //24
            'вул. Євгена Коновальця',
            'вул. Лесі Українки', //26
            'вул. Січових Стрільців',
            'вул. Віктора Чміленка, смт. Щастя', //28
            'вул. Івана Мазепи, смт. Щастя',
            'вул. Олени Пчілки, смт. Радість' //30
        ];

        for ($i = 0; $i < 30; $i++) {
            $realEstate = new RealEstate([
                'name' => $titles[$i],
                'slug' => Str::slug(transliterator_transliterate(transliterator_create('Ukrainian-Latin/BGN'),
                    $titles[$i])),
                'location_id' => $i % 17 + 1,
                'address' => $streets[$i],
                'latitude' => round(47.6 + mt_rand() / mt_getrandmax() * (49.1 - 47.6), 2),
                'longitude' => round(22.1 + mt_rand() / mt_getrandmax() * (24.2 - 22.1), 2),
                'description' => 'Продається нерухомість з унікальною можливістю придбання комфортного та просторого житла. Об\'єкт розташований у затишному та безпечному місці, що дозволяє насолоджуватися затишком та спокоєм. Нерухомість має всі необхідні зручності та новітні технології, що забезпечує комфортне проживання. До переваг об\'єкту належать чудова архітектура, привабливий дизайн, якісні будівельні матеріали та простір, що дає змогу забезпечити максимальну функціональність та зручність. Відмінний стан нерухомості та можливість адаптації до будь-яких потреб робить об\'єкт ідеальним вибором для сімейного житла, інвестиційного проекту, комерційної діяльності або для будь-яких інших цілей.',
                'area' => rand(50, 250),
                'floor' => rand(1, 3),
                'number_of_rooms' => rand(1, 15),
                'number_of_beds' => rand(1, 8),
                'user_id' => rand(2, 5),
                'price' => rand(50000, 500000),
                'is_featured' => rand(0, 1),
            ]);
            $realEstate->save();
            $realEstate->addMedia(storage_path('app\\public\\house_bg_' . $realEstate->id . '.jpg'))->toMediaCollection('main_photo');
            $realEstate->addMedia(storage_path('app\\public\\house_bg_' . $realEstate->id . '_0.jpg'))->toMediaCollection('gallery');
            $realEstate->addMedia(storage_path('app\\public\\house_bg_' . $realEstate->id . '_1.jpg'))->toMediaCollection('gallery');
            $realEstate->types()->attach((($realEstate -> id) - 1) % 6 + 1);
        }
    }
}
